In [25]:
import pandas as pd
import numpy as np

# This is what real data often looks like!
messy_employees = {
    'emp_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'name': ['John', 'Sarah', 'Mike', 'Lisa', 'Tom', 'Emma', 'Alex', 'Rachel', 'John', None],
    'department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'IT', 'HR', 'Finance', 'IT', 'Sales'],
    'salary': ['75000', '65000', '80000', None, '60000', '85000', '70000', '95000', '75000', '50000'],
    'experience_yrs': [3, 2, 5, 8, 1, 6, 2, 10, 3, None],
    'join_date': ['2020-01-15', '2021-03-20', '2018-11-10', None, '2022-08-15', 
                  '2017-09-05', '2021-07-30', '2013-12-10', '2020-01-15', '2023-01-01'],
    'performance_score': [85, 92, 78, 88, None, 95, 90, 87, 85, 82]
}

df = pd.DataFrame(messy_employees)
print("=== MESSY EMPLOYEE DATA ===")
df

=== MESSY EMPLOYEE DATA ===

,emp_id,name,department,salary,experience_yrs,join_date,performance_score
0,101,John,IT,75000,3.0,2020-01-15,85.0
1,102,Sarah,HR,65000,2.0,2021-03-20,92.0
2,103,Mike,IT,80000,5.0,2018-11-10,78.0
3,104,Lisa,Finance,None,8.0,None,88.0
4,105,Tom,Marketing,60000,1.0,2022-08-15,NaN
5,106,Emma,IT,85000,6.0,2017-09-05,95.0
6,107,Alex,HR,70000,2.0,2021-07-30,90.0
7,108,Rachel,Finance,95000,10.0,2013-12-10,87.0
8,109,John,IT,75000,3.0,2020-01-15,85.0
9,110,None,Sales,50000,NaN,2023-01-01,82.0

In [ ]:
#ðŸ”¥ LEVEL 2 PRACTICE QUESTIONS
Set 1: Missing Value Management
Q1: How many missing values are in each column?
Q2: Fill missing salaries with the average salary of other employees
Q3: Remove any rows where both 'name' AND 'department' are missing
Q4: Fill missing performance scores with the median value

Set 2: Data Quality & Consistency
Q5: Find and remove duplicate employee records
Q6: Convert 'salary' column from string to integer data type
Q7: Convert 'join_date' to proper datetime format
Q8: Create a clean version where all missing values are handled appropriately

Set 3: Advanced Challenges
Q9: Which department has the most missing data?
Q10: Create a new column 'is_senior' (True if experience > 5 years, False otherwise)

In [14]:
missing_employees = df.isnull().sum()
print(missing_employees)

emp_id               0
name                 1
department           0
salary               1
experience_yrs       1
join_date            1
performance_score    1
dtype: int64

In [8]:
df['salary'] = df['salary'].astype(float)

average_salary = df['salary'].mean()
print(f"Average salary to use: ${average_salary:,.2f}")

missing_salaries = df.fillna({"salary": average_salary})
print(missing_salaries)

NameError: name 'df' is not defined

In [28]:
print("Before your operation:")
print(f"DataFrame shape: {df.shape}")
print(f"Missing names: {df['name'].isnull().sum()}")
print(f"Missing departments: {df['department'].isnull().sum()}")

row_remove = df.dropna()
print(f"\nAfter your dropna(): {row_remove.shape}")

# Check if any rows have both name AND department missing
both_missing = df[df['name'].isnull() & df['department'].isnull()]
print(f"Rows with both name AND department missing: {len(both_missing)}")

Before your operation:
DataFrame shape: (10, 7)
Missing names: 1
Missing departments: 0

After your dropna(): (7, 7)
Rows with both name AND department missing: 0

In [3]:
df['performance_score'] = df['performance_score'].astype(float)

median_value = df['performance_score'].median()
missing_perf = df.fillna({'performance_score': median_value})
print(missing_perf)

NameError: name 'df' is not defined